#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
module.terraform_state.data.aws_region.current: Reading...
module.terraform_state.data.aws_partition.current: Reading...
module.terraform_state.data.aws_caller_identity.current: Reading...
module.terraform_state.data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
module.terraform_state.data.aws_partition.current: Read complete after 0s [id=aws]
module.terraform_state.data.aws_caller_identity.current: Read complete after 1s [id=348129557613]
data.aws_caller_identity.current: Read complete after 1s [id=348129557613]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "terraform-locks"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "App"         = "terraform"
          + "Environment" = "prod"
          + "Name"        = "terraform-state-locking"
          + "Team"        = "DevOps"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "App"         = "terraform"
          + "Environment" = "prod"
          + "Name"        = "terraform-state-locking"
          + "Team"        = "DevOps"
          + "Terraform"   = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.terraform_state.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "terraform_state_348129557613"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "App"         = "terraform"
          + "Environment" = "prod"
          + "Name"        = "terraform-state-storage"
          + "Team"        = "DevOps"
          + "Terraform"   = "true"
        }
      + tags_all                    = {
          + "App"         = "terraform"
          + "Environment" = "prod"
          + "Name"        = "terraform-state-storage"
          + "Team"        = "DevOps"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.terraform_state.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "RemoveOldVersions"
          + status = "Enabled"

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
    }

  # module.terraform_state.aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # module.terraform_state.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.terraform_state.aws_s3_bucket_request_payment_configuration.this[0] will be created
  + resource "aws_s3_bucket_request_payment_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + payer  = "BucketOwner"
    }

  # module.terraform_state.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @thienchuong, Action: `pull_request`, Workflow: `Terraform check`*